{"Review Title":{"0":"Happy with Product","1":"Take photos and videos like a professional","2":"Stand beyond expectation.","3":"Amazing","4":"No words, it’s incredible loved it 15 pro Max","5":"iPhone 15 Pro Max","6":"No competition","7":"phone camera","8":"BEAST","9":"Giving review","10":"One of the best innovation from apple","11":"Just amazing!","12":"good","13":"Super beautiful","14":"Best camera quality","15":"I love all the feturs♥️","16":"About iPhone 15pro max","17":"The Best Feeling Ever 🚀","18":"Good camera","19":"Nice","20":"Beast!!","21":"Highlight- Superv Camera and 120hz refresh rate","22":"Best Camera Phone in the market.","23":"Hot Stuff","24":"Beast phone","25":"The best phone to show that you are doing great","26":"Real Pro phone","27":"Good Mobile (If you have budget go for it. don't buy to impress or on EMI (not worth it))","28":"does charging phone overnight affects battery health??","29":"Awesome camera and best quality phone","30":"I phone15 pro maximum","31":"Not Bad !!!","32":"Best iphone in the world","33":"I don't have an iPhone, can you get me one ? Please 🥺","34":"Nam hi kafi hai","35":"Just Dont Care The Criticism. Very Good","36":"Good","37":"Stylish one..best battery backup..sleek than 14 pro max","38":"Ultimate performance","39":"Worth every penny, awesome battery life","40":"Amazing Lightning fast phone","41":"Superb phone !","42":"Best phone money can buy at the moment","43":"Best Smart Phone ever","44":"Best iphone ever","45":"My experience","46":"Dr Gajanan Ghule","47":"Performance","48":"Super fast charging and performance , best battery life","49":"Love this pro max","50":"Beast Gadget with PROS CONS","51":"Very light","52":"Nice product","53":"Top class","54":"Nice phone.","55":"Best budget Camera mobile under this price must buy fir good performance","56":"Best","57":"A nice phone","58":"Amazing phone","59":"Good phone","60":"Fastest iPhone","61":"Get rid of false reviews . The phone is just awesome as usual .","62":"Good phone","63":"Thanks Tech Hub Store","64":"Very sweet phone","65":"Better than the last Apple Flagship!","66":"Worth the upgrade","67":"Worth money","68":"Battery life","69":"Unleash the Future with the Apple iPhone 15 Pro Max","70":"iPhone 15 pro max take photos only 24 MP while company showing 48 MP","71":"A High end phone for heavy tasks and security.","72":"Packing is bad","73":"Incremental Upgrade with Enhanced Camera","74":"Heating issue not solved after update. Using more than 2 month.","75":"Good product","76":"Heating Issue during Charging & Required AC room for Charging","77":"Good mobile","78":"ok","79":"Hitting","80":"iPhone 15 pro max","81":"Not as expected","82":"Heats","83":"Cranking","84":"Worst phone ever","85":"Apple not aaple","86":"Heating frequently","87":"Device screen not responding.","88":"Worst","89":"Fake Product","90":"159k wasted","91":"Very Poor Quality Product My iPhone have after 1 month use battery draining issue I was facing","92":"Good phone but quality is bad","93":"It not the real iPhone it’s a plastic made poop","94":"pathetic beterry life and call conferencing is nopt working","95":"12345santhosh","96":"Disgusting Experience","97":"Defective product","98":"Amazon sent me an old unit","99":"Ghatiya phone","100":"Ghatiya Phone","101":"Related girl friend","102":"Screen got scratched","103":"Not worth it","104":"Bery expwnaive","105":"Nothing new ,"},"Rating":{"0":"5.0 out of 5 stars","1":"5.0 out of 5 stars","2":"5.0 out of 5 stars","3":"5.0 out of 5 stars","4":"5.0 out of 5 stars","5":"5.0 out of 5 stars","6":"5.0 out of 5 stars","7":"5.0 out of 5 stars","8":"5.0 out of 5 stars","9":"5.0 out of 5 stars","10":"5.0 out of 5 stars","11":"5.0 out of 5 stars","12":"5.0 out of 5 stars","13":"5.0 out of 5 stars","14":"5.0 out of 5 stars","15":"5.0 out of 5 stars","16":"5.0 out of 5 stars","17":"5.0 out of 5 stars","18":"5.0 out of 5 stars","19":"5.0 out of 5 stars","20":"5.0 out of 5 stars","21":"5.0 out of 5 stars","22":"5.0 out of 5 stars","23":"5.0 out of 5 stars","24":"5.0 out of 5 stars","25":"5.0 out of 5 stars","26":"5.0 out of 5 stars","27":"5.0 out of 5 stars","28":"5.0 out of 5 stars","29":"5.0 out of 5 stars","30":"5.0 out of 5 stars","31":"5.0 out of 5 stars","32":"5.0 out of 5 stars","33":"5.0 out of 5 stars","34":"5.0 out of 5 stars","35":"5.0 out of 5 stars","36":"5.0 out of 5 stars","37":"5.0 out of 5 stars","38":"5.0 out of 5 stars","39":"5.0 out of 5 stars","40":"5.0 out of 5 stars","41":"5.0 out of 5 stars","42":"5.0 out of 5 stars","43":"5.0 out of 5 stars","44":"5.0 out of 5 stars","45":"5.0 out of 5 stars","46":"5.0 out of 5 stars","47":"5.0 out of 5 stars","48":"5.0 out of 5 stars","49":"5.0 out of 5 stars","50":"5.0 out of 5 stars","51":"5.0 out of 5 stars","52":"5.0 out of 5 stars","53":"5.0 out of 5 stars","54":"5.0 out of 5 stars","55":"5.0 out of 5 stars","56":"5.0 out of 5 stars","57":"5.0 out of 5 stars","58":"5.0 out of 5 stars","59":"5.0 out of 5 stars","60":"5.0 out of 5 stars","61":"5.0 out of 5 stars","62":"5.0 out of 5 stars","63":"5.0 out of 5 stars","64":"5.0 out of 5 stars","65":"5.0 out of 5 stars","66":"5.0 out of 5 stars","67":"4.0 out of 5 stars","68":"4.0 out of 5 stars","69":"4.0 out of 5 stars","70":"4.0 out of 5 stars","71":"4.0 out of 5 stars","72":"4.0 out of 5 stars","73":"4.0 out of 5 stars","74":"4.0 out of 5 stars","75":"4.0 out of 5 stars","76":"3.0 out of 5 stars","77":"3.0 out of 5 stars","78":"3.0 out of 5 stars","79":"3.0 out of 5 stars","80":"3.0 out of 5 stars","81":"3.0 out of 5 stars","82":"3.0 out of 5 stars","83":"2.0 out of 5 stars","84":"1.0 out of 5 stars","85":"1.0 out of 5 stars","86":"1.0 out of 5 stars","87":"1.0 out of 5 stars","88":"1.0 out of 5 stars","89":"1.0 out of 5 stars","90":"1.0 out of 5 stars","91":"1.0 out of 5 stars","92":"1.0 out of 5 stars","93":"1.0 out of 5 stars","94":"1.0 out of 5 stars","95":"1.0 out of 5 stars","96":"1.0 out of 5 stars","97":"1.0 out of 5 stars","98":"1.0 out of 5 stars","99":"1.0 out of 5 stars","100":"1.0 out of 5 stars","101":"1.0 out of 5 stars","102":"1.0 out of 5 stars","103":"1.0 out of 5 stars","104":"1.0 out of 5 stars","105":"1.0 out of 5 stars"},"Review Body":{"0":"\nGood Product but Price Was High and I Trust amazon Thank you\n","1":"\nThe iPhone 15 Pro Max is a very versatile phone with professional cameras having 4 options of optical lenses of 0.5x, 1x, 2x and 5x and a macro lens option. It is better and more cost effective than having an SLR camera with many lens options, which you need to acquire. The charge lasts long enough for my filming videos of YouTube channel. Superb\n","2":"\nExcellent device at any expects.\n","3":"\nDon't think about it if you want to go for a flagship just go for it. It's an overall package,but the battery life is at another level it goes on for 2 days\n","4":"\nIt’s very good\n","5":"\niPhone 15 Pro Max Product ReviewFeatures:A17 Bionic Chip: The latest processor ensures lightning-fast performance and efficient power consumption.6.7-Inch Super Retina XDR Display: Stunning display quality with ProMotion technology for smoother scrolling and responsiveness.Pro Camera System: Triple-lens setup with improved low-light performance, 5x optical zoom, and advanced AI photography features.Titanium Frame: New durable and lightweight frame design that enhances both aesthetics and structural integrity.Battery Life: Up to 29 hours of video playback, significantly improved from previous models.iOS 17: Comes preloaded with the latest version of Apple's operating system, offering new features and enhancements.MagSafe 3: Improved magnetic attachment for accessories and faster wireless charging capabilities.5G Connectivity: Supports the latest 5G bands for faster internet speeds and better connectivity.Face ID: Enhanced facial recognition with faster response time and improved security.USB-C Port: Transition from Lightning to USB-C for faster data transfer and universal compatibility.Advantages:Superior Performance: The A17 Bionic chip delivers top-notch performance, making multitasking, gaming, and daily tasks incredibly smooth.Exceptional Camera Quality: The pro camera system captures stunning photos and videos, even in challenging lighting conditions.Long-Lasting Battery: With up to 29 hours of video playback, the battery life is exceptional, perfect for heavy users.Robust Build Quality: The titanium frame not only looks premium but also adds to the device's durability without making it too heavy.Future-Proof Connectivity: With 5G support and the new USB-C port, the device is well-equipped for the future of connectivity and accessories.Disadvantages:High Price: The premium features come at a high cost, making it less accessible to budget-conscious consumers.Limited Customization: iOS, while efficient, offers less customization compared to Android devices.Hefty Size: The 6.7-inch display, while beautiful, makes the device large and potentially unwieldy for some users.Accessory Compatibility: The switch to USB-C means previous Lightning accessories are now obsolete without an adapter.Incremental Upgrades: Some users may find the upgrades from the iPhone 14 Pro Max to be incremental rather than revolutionary.Feedback:The iPhone 15 Pro Max is an impressive addition to Apple's lineup, boasting a suite of advanced features that cater to both performance enthusiasts and photography lovers. The A17 Bionic chip ensures that the device is capable of handling any task with ease, while the new camera system sets a new standard for smartphone photography. The battery life is commendable, easily lasting a full day of heavy use.Value for Money:The iPhone 15 Pro Max is undoubtedly a premium device with a premium price tag. It offers excellent value for those seeking top-tier performance, camera capabilities, and future-proof features.\n","6":"\nI think there is no need to justify that this is the best phone on the planet. In every aspect this is best.\n","7":"\nThe iPhone 15 Pro Max is a powerhouse device, offering top-tier performance, an exceptional camera setup, and a gorgeous display. Its sleek design and long battery life ensure it's ready for anything. While it's pricey, the overall experience justifies the investment for tech enthusiasts and professionals alike.\n","8":"\nMind blowing Speed. No heating issues. Awesome camera for videos and photography (astro).\n","9":"\nBhaiya theek thakh laga do har baar apse hi se lete hain. (Reviewing that I Might delete later) Thank you\n","10":"\nGreat phone with perfect camera quality , battery life is 100 no over heating charging 8s decent.Best in stability.Brightness is good.Certainly awesome\n","11":"\nJust amazing product. Actually I like to purchase online products but as it's so expensive, I tried to purchase from local store in Barasat but they told me 8 thousand more than online price (Only phone's price)😀 even without charger, screen protector and back cover.I got it on online with everything only ₹1,52,000. Although it was a little difficult to buy, as you know it is not easy to transfer the higher amounts within short time. 😀However, Thanks to Amazon team and specially thanks to my IDOL \"Steve Jobs\" 🙏🤗\n","12":"\nso lagg cant even play hill climb racing smoothly . dont waste money . nokia is better buy nokia 11 pro max that can run everything smoothly\n","13":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nPhone is just amazing and\n","14":"","15":"\nNothing to dislike battery life is too goodLove the lookBest camera fetureThis worth the money no regret ✌️Just go & buy it & try it .\n","16":"\nThe iPhone 15 Pro Max is a powerful and feature-packed device with a stunning display and excellent camera capabilities. However, the high price point may deter some potential buyers.\n","17":"\nBest Smartphone EverCamera 10\/10Processor 10\/10Videography 10\/10Display 10\/10Speakers 11\/10Type C 10\/10Battery Backup 11\/10Ecosystem 10\/10\n","18":"\nBest camera till date and batter last for 1day and it feels very premium when you hold it and due to curve edge it doesn’t irritate\n","19":"\nThanks\n","20":"\nI would prefer this over S24 ultra. Used both phones and impressed by this phone. Yes I agree s24 ultra had few more features but in terms of quality 15 pro max wins. And camera quality is far better than s24ultra. But it differs on a customer’s choice.\n","21":"","22":"","23":"\nThis Phone is like the Central processing unit (CPU) with a screen. It is fast as thunder and got heated like lava after using it for sometime. Camera is better than reflection of mirror and it's screen and overall body is weaker than a mirror i.e. it breaks easily.\n","24":"\nWow, such a great phone, superfast, great performance, great camera, great looks\n","25":"\nA phone that screams that you are doing very well for yourself. Don’t get me wrong, it works extremely well and I am completely satisfied with it. but, it is way too expensive for a phone. I have a pixel 8 which as a secondary phone which costs way less and I am satisfied with that as well. Nevertheless, nothing can replace an iPhone for me due to personal preferences\n","26":"\nA17 Pro , 3Nm ,Ray tracing , 5x zoom nailed it completely. A truly freaking flagship mobile so far. iOs 18 will make it more powerful.\n","27":"\nAs I was aware that what I need and what I was paying for, I needed a quality mobile with best hardware and software combination.I need the OS to be clean without any bloatware which I got.I don't play games. For moderate use of Social media, whatsapp, youtube, audible (audio books), music while exercising, Battery life is around 2 days or sometimes more than 2 days. If you are a gamer or use mobile a lot you might need to charge your mobile everyday.Camera is good. So far the pictures I took the quality is good.Not explore the processor's capacity yet but Never hanged or never will for me (not a heavy user so won't be a problem).\n","28":"\n15 pro max >>>> all androids .  the speed the camera the new ios justtt superbthe resident evil village runs so smoothly\n","29":"\nI recently switched from android to iphone. So i am liking the good audio quality, camera and everything.\n","30":"\nAccha hai bass aur kya bolu.Haa kabhi lag karta hai,Aur thoda expensive bhi hai.Thanks for watching and future review bhi aate rahenge\n","31":"\nOverpriced. It should not cost more than 1.1L. Bought it at 1.6L viz 50K extra I felt. Go for 15 instead of pro max. Overhyped phone this one is\n","32":"\nI like in this phone best cameraAnd back glass is not too strong andIt is mild then other iphone's\n","33":"\nIphone always the better than Android , I need the iphone please give me one Amazon please amazon Amazon Amazon\n","34":"\nUltimate performance but some bug issue in 17.2.1 update and FB is not functioning properly….😏😏😏😏😏Lot of BUG issues are experienced in this phone and needs to correct it.\n","35":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nWe Know Nowadays There was so much hate spreading on Iphone 15 Series But as i am a techie, i know most of the critics had never used and talking like trash bin. i Using From Past 1 month, If You Love Photography Or Pro-Gaming then you are good to take this smartphone. Just Dont Care The Criticism.I Too Had Feel The Phone Is warm while heavy gaming and Photography, But was never like what had they said in news. I Loved The Photos The Phone Gives.\n","36":"\nGood\n","37":"","38":"\nIt’s around 2months I have been using this device and it has been working flawlessly. No heating issues or such. Totally worth the upgrade because of the camera.\n","39":"\nIf you already have 14 Pro or Pro Max then don't upgrade, but if you've any other Pro or non Pro models go for it. If you need an iPhone with 24-26hr battery life on a single charge then go for Pro Max models. No doubt Apple's 4K 60fps ProRes is really awesome, and the all new type-c port is the best thing Apple has done in years. Also all the type-c cables included in the box are woven design, now expecting this will not turn grey after few months of use.\n","40":"\nThe phone is really good it had some overheating issue as heard but not faced any it was due to software update now it is all fixed I still did not had any issue regarding overheating. The phone is really fast and the battery life is awesome. The new action button is really handy and useful. The camera is the best camera an iPhone ever had the photos are stunning and spectacular…. I am satisfied with the phone..\n","41":"\nIt’s a great buy. I upgraded from XS Max and am so glad I decided to get this. It’s pricey but worth it. Very powerful battery too\n","42":"","43":"\nIt’s a fantastic phone…the feel and comfort in hand is awesome…looks stunning…also the brand appeal of Apple is fabulous. Camera is the best, performance is over the top…really fast and the games you can play are of play station’s…can any other phone do that…also the video quality is very nice…\n","44":"\nNo heating issue. Even if they exists for you. Use phone on battery saver mode amazing performance  Very good phone.\n","45":"\nI like all the things in iphone 15 Promax the camera is the world it is totally amazing product Thanks amazon\n","46":"\nLightning fast,titanium tantrums\n","47":"\nPerformance very strong Charging\n","48":"\nFast charging\n","49":"\nbest iphone ever used\n","50":"\nPros :Light weighted ~ My XR weighted more than pro max. It is lighter.Good performance ~ Very smoothGood battery life ~ I charged it 100% at 3 PM now after lazy use it is at 61% at 10.30 PM and Next day till 3.33 PM it is at 18%, which is quite good.Also 5G works good, in my XR there were hardly any networks but it’s antenna is really good. 5G works like a charm.Cons :Heating was there in 16.0.x but fixed in 17.0.1, in 16.0.x it heats up around cam area at the top mainly.Now after the fix,It heated up in 30-40% charging, then heated up again in 70%, at 80% it is cool, and at 100% it was cool. Which is normal, trust me all iPhones heats up, even my XR heats up but is not observable because of the phone cover.Battery took around 2 hours to charge(my battery was at 6% I put up on charging around 1 PM and at 2.45 or 3 PM it was around 100% now I have set the limit to 80% for good battery life)Later at around 100% battery when I used basic app, it heats up a little around cam area but the heat is very minor. Since I am not using any cover so I felt it.Overall after the fix, the heating is resolved completely, so you can be assured in this area.Battery backup is quite good, I am using 80% optimised battery option and y’day night I charged it and today till 8.26 PM it is at 27%, I watched video, shopping apps, social media apps heavily.It keeps a check of your battery charging cycle, since I’m using 80% Limit, the charging has fasten up, it usually takes 35-40 min for 80% and then after it slows down the charging.Durability : I have checked few reviews, the back panel is weak it has high chances of breaking, the front glass is strong but could get scratches.USE COVERS AND TEMPERED. Overall for apple users, it is a beast in performance. Do not panic if this gets heats up, it is an APP and OS issue.I’m observing the apps and OS and the heating area but it is doing brilliant so far.Cam Quality : I am not liking the front camera pictures, it actually overdo the image, you might not like Selfies but there are plenty of options for video and camera. You can shoot in 4K and Raw max, etc.I’m not a selfie lover so it is kinda okay for me but you will def not like the after camera processing selfie image.Sound Quality: The best, superior DOLBY sound quality. I haven’t heard this much of brilliant sound in any of the devices in recent times. Decent sound..!! You will love the music and AV.FYI : It fell down from a meter height but since I had a good case so nothing happened luckily. pls make sure you have a good cover. I saw videos the back panel is weak due to different assembly in this series.PS : I’m not a heavy user. I don't play games, so cannot review on the heat and battery while playing games.\n","51":"\nBest performance smartphoneValue for moneyVery light phoneNo heating issuesBest phone if no budget problem for sure\n","52":"\nBattery 10\/10Cemra 10\/10Performance 10\/10Disign 10\/10Display 10\/10Agar pese hai to isse Badiya phone nahi hai market ne Phil haal\n","53":"\nWhen you hold this phone in your hand then only you can realise feeling of holding a premium phone 🍎\n","54":"\nI have purchased natural titanium and it's really awesome. My first phone purchased with my hardwork. Didn't sold my kidney for it 😂😂\n","55":"\nNice Phn bought under very good price  Super sleek nice handy  vulnerable best rate so budget in hatts of to apple for making value products\n","56":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nBest camera everything feels like pro Outstanding performance battery life and a premium experiencePerforms everything fast and best for gaming and the natural taitanium colour looks so good it looks  grey and diffrent from others\n","57":"\nWe have received the iPhone 15 Pro Max, natural titanium color, and 256 GB storage capacity. The phone is good-looking and fast. It gets charged with the Apple 20W USB-C Power Adapter  (purchased separately). It also charges well using my 3-year-old Mi wireless charger (Qi charging). Overall, we are happy with the iPhone.\n","58":"\nThis is my 1 st pro iPhone. And so far I’m really impressed with the performance and simplicity of the product.\n","59":"\nNo heating issue till now running well with the new software update I have installed lots of apps and the ph is running well\n","60":"\nTill this date it is the fastest iPhone for gaming and all over daily usage .Strongest iPhone till now\n","61":"\nSuperb\n","62":"\nGood phone with all thing are there in it.... No need to go for samsung..Just go and enjoy it\n","63":"","64":"\nBest phone ever seen it's the best phone in the earth worth buyable for those who are 4G iphone users.\n","65":"\nGot the info it is in stock from X (twitter). Usually always unavailable.Premium phone from a premium company. Original product.\n","66":"\nThe aluminium has made the phone very light weight you will immediately feel the difference coming from any previous pro max, worth the upgrade if you are coming from 11 series\n","67":"\nThe battery is little problem need to charge once in a day. But other then that all good picture quality is epic attached moon pic for example\n","68":"\nBattery life is quite bad , honestly the battery life  should be a bit better I this range of price.\n","69":"\nIn the fast-paced world of smartphones, Apple continues to set the bar high with each new iteration of their iconic iPhone lineup. The iPhone 15 Pro Max is no exception, boasting cutting-edge technology, stunning design, and a plethora of features that promise to elevate your mobile experience to new heights. In this comprehensive review, we'll delve into the positive aspects as well as the potential drawbacks of Apple's latest flagship device.Positive Points:1. Revolutionary Design:The iPhone 15 Pro Max features a sleek and sophisticated design that pushes the boundaries of smartphone aesthetics. With its edge-to-edge display, premium materials, and refined finish, it exudes elegance and craftsmanship. The slim profile and ergonomic curves make it comfortable to hold, while the durable construction ensures longevity.2. Stunning Display:At the heart of the iPhone 15 Pro Max is its mesmerizing display, which sets new standards for clarity, brightness, and color accuracy. The ProMotion OLED panel delivers vibrant colors, deep blacks, and HDR content support for an immersive viewing experience. Whether you're browsing the web, watching movies, or playing games, every detail comes to life with stunning realism.3. Exceptional Performance:Powered by Apple's latest A-series chip, the iPhone 15 Pro Max offers unparalleled performance and efficiency. From multitasking to gaming, every task is handled with lightning speed and responsiveness. The advanced neural engine enhances machine learning capabilities, enabling intelligent features like enhanced photography and augmented reality experiences.4. Revolutionary Camera System:The iPhone 15 Pro Max boasts a revolutionary camera system that redefines smartphone photography. With advanced computational photography features, including improved Night mode, Deep Fusion, and Smart HDR, every shot is optimized for clarity and detail. The ProRAW and ProRes video recording capabilities offer professional-grade flexibility and control, allowing users to unleash their creativity.5. Enhanced Battery Life:Despite its powerful performance and advanced features, the iPhone 15 Pro Max delivers impressive battery life that keeps up with your busy lifestyle. The optimized hardware and software integration ensure efficient power management, allowing you to stay connected and productive throughout the day. With support for fast charging and wireless charging, recharging is faster and more convenient than ever.Negative Points:1. Premium Price Tag:As with previous iPhone models, the iPhone 15 Pro Max comes with a premium price tag that may be prohibitive for some consumers. While the investment is justified by its advanced features and performance, it may not be accessible to budget-conscious buyers.2. Lack of Major Design Changes:While the iPhone 15 Pro Max boasts an impressive design, some critics may argue that it lacks major design changes compared to its predecessors. The overall form factor remains largely unchanged, leading to criticisms of stagnation in design innovation.3. Dependency on Ecosystem:The iPhone 15 Pro Max is part of Apple's ecosystem, which offers seamless integration with other Apple devices and services. While this can be a positive aspect for existing Apple users, it may pose challenges for users who prefer a more open ecosystem or who are heavily invested in competing platforms.4. Incremental Upgrades:Despite its status as a flagship device, some users may perceive the iPhone 15 Pro Max as offering only incremental upgrades over previous models. While the improvements in performance, camera technology, and battery life are notable, they may not be significant enough to justify upgrading for some users.Conclusion:In conclusion, the Apple iPhone 15 Pro Max is a remarkable smartphone that pushes the boundaries of innovation and performance. With its revolutionary design, stunning display, exceptional performance, revolutionary camera system, and enhanced battery life, it offers a truly immersive mobile experience. While it may have some drawbacks such as its premium price tag, lack of major design changes, dependency on ecosystem, and incremental upgrades, its overall strengths far outweigh its weaknesses. Whether you're a tech enthusiast, a professional photographer, or simply someone who demands the best from their smartphone, the iPhone 15 Pro Max delivers in spades.\n","70":"\nCamera setting not available, so photos not better than Samsung m34, likely Caller tune should not set, call record not available. Should not connect to laptop. Download space not available\n","71":"\nThe iPhone 15 pro max is the latest flagship smartphone from Apple, and it offers some impressive features and performance. I have been using it for a month now, and here are my thoughts on it.Design and DisplayThe iPhone 15 pro max has a sleek and elegant design, with a stainless steel frame and a ceramic shield glass back. It is available in four colors: silver, graphite, gold, and pacific blue. The phone is water and dust resistant, and it supports wireless charging and MagSafe accessories.The display is a 6.7-inch OLED screen, with a resolution of 2778 x 1284 pixels and a refresh rate of 120 Hz. The screen is bright, sharp, and smooth, and it supports HDR10 and Dolby Vision. The notch at the top houses the Face ID sensor and the 12 MP selfie camera.Camera and BatteryThe iPhone 15 pro max has a triple rear camera system, consisting of a 12 MP wide-angle lens, a 12 MP telephoto lens, and a 12 MP ultra-wide-angle lens. The camera can capture stunning photos and videos, with optical image stabilization, 5x optical zoom, night mode, portrait mode, and 4K video recording at 60 fps. The camera also supports LiDAR scanning, which enables faster autofocus and better depth sensing.The battery life of the iPhone 15 pro max is excellent, as it can last for a whole day of heavy usage. The phone supports fast charging, and it can reach 50% charge in 30 minutes with a 20W adapter. The phone also supports wireless charging and MagSafe charging, which can deliver up to 15W of power.Performance and SoftwareThe iPhone 15 pro max is powered by the A15 Bionic chip, which is the most advanced processor in the market. The chip has a six-core CPU, a five-core GPU, and a 16-core neural engine. The phone can handle any task or app with ease, and it delivers smooth and fast performance. The phone has 6 GB of RAM and comes in three storage options: 128 GB, 256 GB, and 512 GB.The iPhone 15 pro max runs on iOS 15, which is the latest version of Apple's operating system. iOS 15 offers many new features and improvements, such as widgets, app library, picture-in-picture, app clips, and more. iOS 15 also enhances the privacy and security of the phone, with features like app tracking transparency, sign in with Apple, and Face ID.ConclusionThe iPhone 15 pro max is a premium and powerful smartphone, that offers a great user experience. The phone has a beautiful design and display, a superb camera and battery, and a blazing-fast performance and software. The phone is expensive, but it is worth the money for anyone who wants the best of the best. I would highly recommend the iPhone 15 pro max to anyone who is looking for a high-end smartphone.\n","72":"\nPacking is bad. There's a tampered package within a new package. The tampered package contained the phone. But the phone is looking good\n","73":"\nI recently upgraded to the Apple 15 Pro Max, and while the enhanced camera is undoubtedly impressive, but I feel that it falls short of delivering a truly groundbreaking experience. If you're already using the 13 pro or 14 Pro, there seems to be little incentive to make the leap.The camera improvements are noteworthy, capturing detail and clarity like never before. However, beyond this feature, the 15 Pro Max doesn't offer a significant leap in terms of innovation. Personally, I find the Pro versions more manageable in hand, and the Max variant, although boasting a larger screen, can be a bit unwieldy.In essence, the 15 Pro Max is a solid device with a stellar camera, but for those already enjoying the perks of the previous Pro models, the upgrade might not feel as compelling.\n","74":"\nCamera quality is best\n","75":"\nGood product\n","76":"\nHeating Issue during Charging & Required AC room for Charging otherwise charging will stop due to mobile heating \/ high temperature which is a major issue in Apple iPhone 15 Pro Max.I suggest avoiding it, especially in the summer, if you don't have an AC room.This is my personal experience!!\n","77":"\nGood mobile but Too much price. Features are ok but price are extra ordinary. Not value for money. Avoid if you have not enough money\n","78":"\nthis is very bad iphone it lacks kanye west it is travis scott and has a jawline it is very ewwwwwwwww we cannot play cricket wws💀💀💀💀\n","79":"\nHitting problem watching video and charging\n","80":"\nCamera Quality not good\n","81":"\nIf at all looking for pro model just because of lidar and action button and camera. Its not value for money as the charging and performance are not upto the mark for both pro and non pro models. I purchased iPhone 15 pro 128gb not happy\n","82":"\nHeats very much during charger. Even if apple type c charger is used.No much difference from 14 pro max.\n","83":"\nIts hanging alot,sometimes it doesn’t charge and it act cranking the screen will not work\n","84":"\nAfter uprade display isnt working well after 2hrs of upgrades the display shutdown and later i had to take the mobile in service center they told me the display is gone. Waste of money\n","85":"\nApple is not producing seeds how me make more apple, apple baby not coming from charging hole, please send apple doctor to keep apple away a day\n","86":"\nReally disappointing to see that being a premium phone it’s heating issue is just in another level\n","87":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nRecently, I updated to the latest version of 17.5.1 added emojis something like that and after that my device touch screen isn't responding now. And when I used the phone earlier, the device gets too warm easily when I started to play games...and I contacted the Amazon and iOS support and told me to visit the service centre and the service centre is like 1-2 days far from my home location. This isn't something I expected. The phone is very expensive and I bought recently, just in 1-2 months the device isn't usable, it need to be trash now smh...The device isn't even charging now..\n","88":"\nI don't like this product I think nothing has changed from iPhone 14 don't buy this phone or you well waste your 1,50,000\n","89":"\nFake duplicated Phone is given\n","90":"\nMy biggest mistake buying this, you can to same things in 15 and 14 and 13\n","91":"\niPhone battery and multimedia experience was very Poor Quality Don't buy this dumb iPhone 15 Pro Max 256 GB .\n","92":"\nDon't buy waste of money otherwise take samsung s25 ultra in so rich it is so because I buy it don't buy\n","93":"\nHate it ssoooooo much it’s 🤢🤢🤢🤢🤢 just kidding it’s the best phone I have ever seen 😁😁😁😁😁 best battery life\n","94":"\niphone 15pro max ios worst pro max I purchased. I already have 13 and 14 pro max, Time to switch to Samsung. The screeenshot you see shows 85% baterrey charge but it has been only 5 min after i made a full charge of the phone\n","95":"\nCompare to iphone 14 pro max 15 pro max is very worst.. Past 1 month i used 15 pro max i faced lot of heating issue and battery life is worst.. If you want to buy iphone i recommend 14 pro max\n","96":"\nThe box had a different colour. I order black Titanium....box was black Titanium but phone was natural titanium inside ...It's heart wrenching...Trust shaken...The phone looks usedIt can happen with Apple product also...it's a shock.\n","97":"\nGot a defective product where the camera doest load\n","98":"\nbox damaged, no new device smell. Completely ruined my unboxing experience. But the phone is amazing.\n","99":"\nHangs a lot! Also lagse when using camera. In settings it shows GS5 PRO MAX VARIENT! 😭😭 I bought it for 60000\n","100":"\nEk number ghatiya phone. dont waste 2lacs on this. Instead pay me some money if you have too much . Dont buy\n","101":"\nBro 1 v ladki nhi pategi iss phone se... Bhaut bekar hai.... Mera paisa doob gya 2lakh..socha bhaut ladki pategi... Bt ab jaa rha hu duke 390 lene syad usse pat jaye.. Amazon\n","102":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nDidn't use a screen guard for a week and found a scratch on the screen. What a stupid phone. 160k phone and you will get a scratch without even holding the phone. Better get a screen guard the day you receive the phone.\n","103":"\nIt seems to be highly expensive and on the other side it's features can't be matched up with Android.It doesn't have fast charging also unlike Android\n","104":"\nVery bad phone and exoensiceNot good camera nd performace of 10k phn redmi is better than this even nokia dont buy dont buy\n","105":"\nNothing new in this phone , just getting things repeated in earlier model,  Apple has nothing to offer new,  seems forgotten their tag line , think different\n"}}