{"Review Title":{"0":"As expected","1":"FIRE 🔥🤤","2":"Gaming reignited!","3":"Good.","4":"The Sony PlayStation 5 is a beast!","5":"Delivery service","6":"For all gamers","7":"Awesome Experience","8":"Best gaming console","9":"Best for gaming","10":"Game, chill, repeat","11":"Worth Buying 👌👌","12":"Good","13":"Best Console","14":"Worth buying!","15":"Awesome 👌","16":"Ps5 slim","17":"Good condition","18":"Good product but box damage","19":"Buy the regular one","20":"Very bad i order ps5 slim but disc driver not work properly not taking dick insert","21":"The box was damaged."},"Rating":{"0":"5.0 out of 5 stars","1":"5.0 out of 5 stars","2":"5.0 out of 5 stars","3":"5.0 out of 5 stars","4":"5.0 out of 5 stars","5":"5.0 out of 5 stars","6":"5.0 out of 5 stars","7":"5.0 out of 5 stars","8":"5.0 out of 5 stars","9":"5.0 out of 5 stars","10":"5.0 out of 5 stars","11":"5.0 out of 5 stars","12":"5.0 out of 5 stars","13":"5.0 out of 5 stars","14":"5.0 out of 5 stars","15":"5.0 out of 5 stars","16":"5.0 out of 5 stars","17":"4.0 out of 5 stars","18":"4.0 out of 5 stars","19":"3.0 out of 5 stars","20":"1.0 out of 5 stars","21":"1.0 out of 5 stars"},"Review Body":{"0":"\nGot this on days of summer sale at 49900, came in excellent condition and looked perfectly fine.\n","1":"\nOut of this world experience. Just go for it.\n","2":"\nWaiting for a slim model to arrive as I lost interest with the fat console due to the initial supply chain issues. Even there aren't exciting first party titles but PS5 isn't just for the first party titles.Nevertheless I finally upgarded it after 10 years of using my OG PS4. Happy with the fast download speeds, loading time and No more jet engine sound when playing games.\n","3":"\nLiked the designSuuuuuuuuuuuuuuuuuuuuuuuuper good the game becomes more interesting with this I like it very very very very much\n","4":"\nIt has been just 4 days now, that I bought this, and all I can say is I am very happy with this product.I have always been a fanboy of Sony since my childhood, starting from the time when I used to watch my father be a fanboy of this company. He was always fascinated by Sony’s audio products such as the speakers, the Bravia TVs, etc.My first Sony purchase was a PSP and oh boy, I really miss those times getting my hands on that gadget. That portable console was the best to play with and I believe it still is very relevant to this date. And my first phone purchase was the Sony Xperia C and to this date I can say that I was a very proud and satisfied owner of that phone.The Sony PlayStation 5 is a beast. It is amazing to play with. I was very nervous since this was my first major gaming console purchase and I had been waiting for a PlayStation since more than a decade now. All I can say is I am the happiest at this moment and I am glad that I bought this. Now, just waiting for GTA 6 to release! ;)\n","5":"\nEverything among the product is good just a small feedback the delivery service is really poor i live in City in indore still so much of delay, also in PS5 slim there are 2 major problems the disc Never goes in smoothly it takes some time for doing that also for the controller after installing for the first time it won't work properly until you restart and everything else is good go for it👍❤️\n","6":"\nWaited to own one for a long time.... Finally so yeah.. all good\n","7":"\nBest gaming experience… video quality is so good and without any lag…\n","8":"\nThe PlayStation 5 is a powerhouse console, offering stunning graphics, fast load times, and a diverse library of games. Its DualSense controller introduces immersive haptic feedback, enhancing gameplay experiences. Overall, it's a fantastic gaming system for both casual and hardcore gamers alike.\n","9":"\nGood product buy it  was better than ps5 fat and\n","10":"\nThis is the best console ever, size is compact as compared to previous gen plus it comes with some extra gigs of memory.Though buying the console is only the beginning, coz u myt need to purchase some accessories like spare controller, wall mount, Headphones, UPS, 1 or 2TB SSD and obviously the costly games and all this stuff will significantly increase the overall investment cost.Anyways when u r really into gaming, these expenditures only add to ur happiness..So, Happy Gaming to all🤟\n","11":"\nGot the product and it’s working perfectly fine.But packaging was sightly torn from above but seal was intact. So happy with delivery.\n","12":"\nGood morning sir I am not able to join the meeting today at restaurant and easy to hhjb jiw ipqh\n","13":"","14":"\nIt is smaller and has around 180GB more than normal ps5. Got the package on time without any damages. Happy gaming to all ✌🏻\n","15":"\nProduct is super cool but I don't think it's Indian PS5 Slim as there is no guarantee card inside box.Go for it.\n","16":"\nBest console ever like manyy exclusive titles and many exciting games to download overall the best console ever released especially with that slim size and more storage\n","17":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n","18":"\nReceived part box damage at corners .Satisfied with product .  package 4 stars but for package 0 star . Amazon must be very strict with vendors while delivery.\n","19":"\nAlthough this has more storage (around 180 gigs), the ps5 standard costs only ₹45000 and u can buy a 1TB SSD for around 8k (total- 53k).Also in my opinion the og one looks better.\n","20":"\nVery bad\n","21":"\nAfter purchasing such an expensive item we do not expect such damaged item box.  The box was damaged in various places and had tape applied on the front.  I don't know whether the damage was due to the box falling or not.  I am also confused whether the box and PS5 might have suffered any damage due to the fall.  I am not satisfied.  You have to give proper box packing without any damage.\n"}}