{"Review Title":{"0":"Super","1":"Charger is not provided properly","2":"Low budget phone with new phone quality also got 1 year warranty","3":"Yes I like conversation our executive person so thanks","4":"Best","5":"Camera suber","6":"Redmi not 10 photography ❤❤","7":"Very nice phone","8":"SD","9":"Mast","10":"Don't buy any redmi phone ever","11":"It's not 5mp macro I feel. Only 2mp. Can I get an exchange","12":"Pathetic purchase","13":"Damage mobile","14":"Camera problem and mother board problem","15":"Don't buy go for better brand","16":"Battery is most worst","17":"My worst phone in my life","18":"Not actual product delivery charger meet one plus and box is old only and not a mobile safety book"},"Rating":{"0":"5.0 out of 5 stars","1":"5.0 out of 5 stars","2":"5.0 out of 5 stars","3":"5.0 out of 5 stars","4":"5.0 out of 5 stars","5":"5.0 out of 5 stars","6":"5.0 out of 5 stars","7":"5.0 out of 5 stars","8":"5.0 out of 5 stars","9":"5.0 out of 5 stars","10":"1.0 out of 5 stars","11":"1.0 out of 5 stars","12":"1.0 out of 5 stars","13":"1.0 out of 5 stars","14":"1.0 out of 5 stars","15":"1.0 out of 5 stars","16":"1.0 out of 5 stars","17":"1.0 out of 5 stars","18":"1.0 out of 5 stars"},"Review Body":{"0":"\nSuper\n","1":"\nNice☺️\n","2":"\nLow budget phone with new phone quality also got 1 year warranty\n","3":"\nI'm happy too conversation executive person so many thanks\n","4":"\nAwesome\n","5":"\nVery nice mopill\n","6":"","7":"\nGood product. Nice camera\n","8":"\nCamera quality is very good. The captured images are magnificent.\n","9":"\nMast\n","10":"\nI took redmi note 10 pro in 2021 and  it started laging in 2024 itself and this phone got damaged while updating and even the service centre of redmi does not help..\n","11":"\nI purchased this Redmi note 10 pro only for using 5MP Macro lens. Though the super Macro offer exits pictures are not that good like my other cameras or like the photos taken by my friends using the same model.As I could not upload photos the other way you suggested, I chose to download Amazon app and upload this way.Please allow me to return or allow me to get a better 5 mp macro Redmi note 10 pro please.Thank you\n","12":"\nThey are just befooling peopleDon’t buy products from them as there is no return with this productToo bad\n","13":"\nVery bad damage mobile givenReturn money as soon as possible\n","14":"\nCameras not working and issue of mother board glitch screen sim slot not showingDon't buy xaomi mobiles it getting lot of problems day by day after completion of warranty problems occured waste of warranty and company not extending repairing waranty don't buy xaomi mobiles  one plus giving life time waranty of display exchange and mobile\n","15":"\nWorst phone don't go for fake hype created by anyone else.I have bought but it but after i update the front camera stop working.I visited to care they told the phone motherboard will be change at no cost due to company'fault.I have given phone on 30th November 22.It's already a month neither they are repairing neither giving information when it will be ready.everyday i called customer care i mailed to the company but our team will call you back is always the answer.They will harass you & at the end your phone will b just dabba.Think before purchasing\n","16":"\nThe phone is worst and send me old phone,why\n","17":"\nEverything is ok but don't trust the redmi mobiles . Carry the alternat mobile u don't believe when it's spoil .thirdclass company\n","18":"\nDislike\n"}}