{"Review Title":{"0":"Product Review","1":"Great","2":"THE BEST PHONE","3":"iPhone 15 pro","4":"Awesome phone","5":"Great phone","6":"I liked this phone but camera is blur","7":"Good this product","8":"Quality","9":"pro is pro","10":"iPhone is Awesome","11":"Superb phone","12":"Worth an upgrade.","13":"It could be better in battery and camera department","14":"Great with not so great battery","15":"Thanks for Amazon 😍","16":"Amazing","17":"You are getting what you see","18":"Stunner","19":"Bad battery life","20":"Not worth it","21":"Great as always, but not worth the price tag","22":"good","23":"Nc camera","24":"Very poor battery life","25":"Touch related issues","26":"No charger","27":"Heating issues even with original apple charger","28":"🤬 not iphone, I received soap in box","29":"Fake Iphone","30":"It is heating, while taking video, photos, map and video games","31":"Waste of Money","32":"Please get a protector for your camera as soon as possible","33":"Dont Buy","34":"Product damaged. Worst. Item defective.","35":"Nakali iPhone ki video kyon banaun main","36":"High price","37":"Worst product"},"Rating":{"0":"5.0 out of 5 stars","1":"5.0 out of 5 stars","2":"5.0 out of 5 stars","3":"5.0 out of 5 stars","4":"5.0 out of 5 stars","5":"5.0 out of 5 stars","6":"5.0 out of 5 stars","7":"5.0 out of 5 stars","8":"5.0 out of 5 stars","9":"5.0 out of 5 stars","10":"4.0 out of 5 stars","11":"4.0 out of 5 stars","12":"4.0 out of 5 stars","13":"4.0 out of 5 stars","14":"4.0 out of 5 stars","15":"4.0 out of 5 stars","16":"4.0 out of 5 stars","17":"4.0 out of 5 stars","18":"4.0 out of 5 stars","19":"4.0 out of 5 stars","20":"3.0 out of 5 stars","21":"3.0 out of 5 stars","22":"3.0 out of 5 stars","23":"3.0 out of 5 stars","24":"2.0 out of 5 stars","25":"2.0 out of 5 stars","26":"2.0 out of 5 stars","27":"2.0 out of 5 stars","28":"1.0 out of 5 stars","29":"1.0 out of 5 stars","30":"1.0 out of 5 stars","31":"1.0 out of 5 stars","32":"1.0 out of 5 stars","33":"1.0 out of 5 stars","34":"1.0 out of 5 stars","35":"1.0 out of 5 stars","36":"1.0 out of 5 stars","37":"1.0 out of 5 stars"},"Review Body":{"0":"\nI got the phone just today the delivery and the data transfer experience is good by the Amazon service. Will be updating the performance and other things later on .\n","1":"\nGreat\n","2":"\nThis Phone Is A Game Changer For Me I Was Using A Basic Samsung M13 4G Until One Day I Saw The iPhone 15 Pro Ad And Decided To Purchase It . You Can Definitely Go For This Phone Without Even Thinking , The Camera Is So Nice You Cannot Compare It Against 24 Ultra .You Will Love The Display Because It Has 120HZ Refresh Rate .\n","3":"\nApple iPhone 15 Pro is Excellent and super I recommend too take this iPhone  for every one and show off infront of every one...\n","4":"\nUpgraded from 12 to 15 Pro. Really embracing the change. No regrets! 👍🏻\n","5":"\nThis phone is so amazing. I would highly recommend this everyone who can buy it.\n","6":"\nBest phone I have ever seen . It is better then other  Iphone,s phone,s  Who think,s I am write but camera is blur\n","7":"\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\nBest camera best battery 🔋 backup lovely family member i like this product 💓we happy 👍 smooth tuch better quality\n","8":"\nCheez tho badiya hai par isme kharcha itna hai naa ki aslii Wale ammer hi aford kar sakte hai .. 🤡\n","9":"\nawesome\n","10":"\nPerformance is good,battery is good,camera superb.Only issue is switch over is reallly tough from Android to iOS.\n","11":"\nPhone needs no review because apple lovers won't even see reviews when it comes to iphones but apple lovers I have a question for you how would you justify the price\n","12":"\nHad upgraded from the Iphone 11 to 15 pro . Many changes and seamless experience but the only issue that exists is the heating issue . The phone heats up while charging , maybe its because of the fast charging but apart from that just browsing Instagram for a certain period heats up the phone. The phone is on the latest update but the issue for heating is yet to be resolved completely. Apart from that everything is flawless especially the camera. Its better if you upgrade from an old Iphone as the experience is flawless.\n","13":"\niPhones are becoming more competitive every year but this year a new iPhone Pro didn't last a day for me. 13 Pro and 14 Pro were better in battery department. I switched over to 15 Pro Max. Thanks to the less weight due to titanium body. This year Pro Max is the best choice or 15 Plus for budget.\n","14":"\nBattery doesn’t last long.\n","15":"\nGood productGood CemaraGood displayVery nice torch displayOsm productFast changing. phone  good priceThanks for Amazon very nice product\n","16":"\nThe phone was good but battery drains too fast .but as I listened 15 pro series having heating issues my device doesn't have.and not have any kind of bug\n","17":"\nI had a iPhone 13 , and now switched to this, the main noticeable difference is the telephoto camera nothing much and the type c\n","18":"\nI’m already in apple ecosystem.I’d an iPhone 14 which I brought in may.Since I was already on a trip in Thailand, brought this for 98k there.The mere feeling of holding the fastest phone on the planet with the first 3nm chip which can even play PC\/PS5 level games is too Damn awesome!\n","19":"\nBattery life is not good. 14 pro and 14 plus has better battery life. Also, Heating issue is there which is irritating.\n","20":"\nWith what we're getting and what we're paying it is not at all worth it. Apple needs to come in terms with the reality. Just paying more for the brand don't work now. The phone Looks mediocre and dull in comparison to pixel and galaxy s24 series.\n","21":"\nBought a 15 Pro from Dubai for 90k and it’s great iPhone for that price. But it’s extremely overpriced in India. There’s no way this iPhone is worth 1.3L. Avoid buying it in India or go for a 13-14 (both are great)\n","22":"\ngood\n","23":"\nVery good and very nice phone sell best and Jada bikne wala phone aaj hi lo is phone ko please bahut aacha h\n","24":"\nI had an iPhone 11 before this. It’s been 3 days of using my new iPhone 15 pro in 256 gb but the battery life is as bad as my 4 year old iPhone 11. Didn’t expect this from Apple. Highly disappointed\n","25":"\nI am facing touch related issues and not working smoothly as I expected. At the time of typing, I have to push hard to type\n","26":"\nApple I phone cost more then 1 lakh but without charger …..what is this????? Rs2000 mobile also giving charger and headphones etc\n","27":"\nCamera is better, suggest not to use other charger adapter. Always use apple charger cable rather using other type C cable.\n","28":"\nI want real product , I got soap in box, apple scam alert, do notbuy , very bad product ,\n","29":"\nFake Iphone received\n","30":"\nNot with for money or\n","31":"\nGetting heat while playing BGMI in just 40 days.Waste of money.\n","32":"\nBefore using iPhone 15 pro, I used iPhone 12 Pro Max for almost 3 year, in that 3 year period, I accidentally dropped my phone dozens of time but nothing happened to the phone as it should be and as what all of us expect! But after using this new phone iPhone 15 pro for just 2 months, I accidentally dropped it from just waist height, that too on a plane surface, still it lead to break one of my camera glass !So please don’t trust iPhone or all other YouTubers please do get a iPhone camera protector!\n","33":"\nI recently purchased an iPhone 15 pro max 1 TB, but it came with 256 GB if I contacted with Apple store they said that we are not responsible for that. They said pls contact Amazon. Then I contacted Amazon customer service they didn't respond properly. I have been with this phone for 2 months. But yesterday I updated to iOS 17.2 after restarting the mobile display got green and it is under warranty too. I had to go to an Apple service center and explain my problem. They said it has some charges but I can't afford them.  Don't buy apple products service is worst. I got mentally disturbed.. and got thoughts of suicide.....e\n","34":"\nItem was delivered with damage. Item not working as well. Very Worst experience. No proper channel to contact for assistance. No valid Apple customer care number available in replacement window. Amazon too cares nothing about this issue despite reaching them umpteen times.\n","35":"\nSamsung le Lo iPhone nahin agar mujhe jyada Paisa a Gaya barbad karna chahte ho to liya ja sakta hai lekin main pregnant nahin karunga kyunki yah nakali hai ya iPhone\n","36":"\nVery high price.. no need to spend this much high hard earned money to just a mobile phone. You can build an awesome pc with this money...\n","37":"\nHanging issue …never I seen in iPhone …since using iPhone from 6 ,x,12pro,14promax….disappointed from iPhone …please give the product to money value\n"}}