{"Review Title":{"0":"Great product","1":"One of the best android platform","2":"Probably highest heating phone","3":"Battery is not upto mark within 1and 1\/2 year it got damage","4":"Google pixel 6a","5":"Most worst hand set"},"Rating":{"0":"5.0 out of 5 stars","1":"5.0 out of 5 stars","2":"2.0 out of 5 stars","3":"2.0 out of 5 stars","4":"1.0 out of 5 stars","5":"1.0 out of 5 stars"},"Review Body":{"0":"\nFirstly, have been using the phone for last 1.5 months and here are some of this things i noticedPros:That camera : Probably the best thing about this phone is this camera, if I'm clicking something ik it will turn out fine ..... Samples included..... Though some small gripe that i have is the phone is too automated and doesn't give u any kind of manual control (iso, shutter) and video could be better but they're good as is it, i don't click selfie much but they're great too overall 9\/10Screen: 60hz doesn't bother me and the phone is smooth so you wouldn't notice 9\/10Speaker : 10\/10Haptics: amazingSoftware experience: amazing though one thing I'll discuss furtherNext are cons and some are big ones:Battery and charging : i don't know why google thought 18w charging in 2023 is good enough it takes around 2+ hours to charge, i came from a 20w realme phone and still it takes half time to charge than this phone with similar battery. Not to mention battery life is just average.I don't let my battery charge beyond 85 and get below 15. Have my Bluetooth connected all the times since it doesn't have a 3.5mm jack. SOT on wifi is good but on cell data it's drops a lot. 5\/10Bugs : Mostly bug free but sometimes it freezes and have to restart some apps but then it works finePerformance: it's fine for daily use easily even slight gaming but if u primarily want for gaming look for something else and it does heat up in warm weather or while using camera too muchVerdict : Buy this phone if u want a great camera and can compromise on battery and charging\n","1":"\nThe Google Pixel 6a is a remarkable addition to the Android smartphone lineup, offering an exceptional blend of cutting-edge features and affordability. From the moment I started using it, the Pixel 6a has consistently impressed me with its performance and innovation.\n","2":"\nHow much it is worthful.Build Quality 4\/5Performance 4\/5Camera 2.5\/5Battery 3\/5In Negative way:Phone Heating 4.5\/5 🥵We can't handle  directly.\n","3":"\nBattery is not upto mark within 1and 1\/2 year it got damage not giving 4 Hr Backup, Software and camera was fine, but when we Pay 30000+ we should expect battery should run atlas 2 to3 years smoothly when doesn't happen here.\n","4":"\nWorst mobile ever in 30000 range..Poor battery, slow charging, small screen, not upto mark camera, and become so hot in a regular usage\n","5":"\nI did a mistake by purchasing this handset. Becomes very hot even when you use the mobile for simple applications. I hate this handset.\n"}}